export const result = '以下是网络路由方案的分解，列出了前三个解决方案：\n' +
    '\n' +
    '1. 伦敦-马赛-吉布提-约翰内斯堡：\n' +
    '   - 子电路1：[LDN2/CU-MRS/CU OTU4-001] [空闲总带宽:69.455G] [时延:17.000]\n' +
    '   - 子电路2：[LDN2/CU-MRS/CU 64S001] [空闲总带宽:9.547G] [时延:未知]\n' +
    '   - 子电路3：[SMW5(亚欧5号海底光缆)] [MRS/CU-DJI/CU 64S001] [空闲总带宽:9.685G] [时延:73.810]\n' +
    '   - 子电路4：[DJI/CU-JHB/CU 16S001] [空闲总带宽:1.014G] [时延:97.600]\n' +
    '\n' +
    '2. 伦敦-巴黎-马赛-吉布提-约翰内斯堡：\n' +
    '   - 子电路1：[LDN/CU-PAR/CU 16S001] [空闲总带宽:1.018G] [预估时延:7]\n' +
    '   - 子电路2：[LDN1/CU-PAR/CU 64S001] [空闲总带宽:6.884G] [时延:7.000]\n' +
    '   - 子电路3：[PAR/CU-MRS/CU OTU4-001] [空闲总带宽:90.0G] [时延:9.160]\n' +
    '   - 子电路4：[ORANGE:LD020118] [空闲总带宽:100.0G] [时延:9.170]\n' +
    '   - 子电路5：[SMW5(亚欧5号海底光缆)] [MRS/CU-DJI/CU 64S001] [空闲总带宽:9.685G] [时延:73.810]\n' +
    '   - 子电路6：[DJI/CU-JHB/CU 16S001] [空闲总带宽:1.014G] [时延:97.600]\n' +
    '\n' +
    '3. 伦敦-法兰克福-马赛-吉布提-约翰内斯堡：\n' +
    '   - 子电路1：[LDN1/CU-FFT2/CU OTU4-001] [空闲总带宽:10.0G] [时延:11.170]\n' +
    '   - 子电路2：[LDN1/CU-FFT2/CU OTU4-002] [空闲总带宽:90.0G] [时延:未知]\n' +
    '   - 子电路3：[FFT2/CU-MRS/CU OTU2-001] [空闲总带宽:9.0G] [时延:1.000]\n' +
    '   - 子电路4：[FFT1/CU-MRS/CU OTU4-002] [空闲总带宽:30.0G] [时延:13.170]\n' +
    '   - 子电路5：[FFT2/CU-MRS/CU OTU4-001] [空闲总带宽:30.0G] [时延:13.240]\n' +
    '   - 子电路6：[FFT2/CU-MRS/CU OTU4-004] [空闲总带宽:50.0G] [预估时延:14]\n' +
    '   - 子电路7：[FFT2/CU-MRS/CU OTU4-003] [空闲总带宽:61.085G] [时延:14.550]\n' +
    '   - 子电路8：[FFT2/CU-MRS/CU 64S001] [空闲总带宽:1.428G] [时延:未知]\n' +
    '   - 子电路9：[SMW5(亚欧5号海底光缆)] [MRS/CU-DJI/CU 64S001] [空闲总带宽:9.685G] [时延:73.810]\n' +
    '   - 子电路10：[DJI/CU-JHB/CU 16S001] [空闲总带宽:1.014G] [时延:97.600]'

export const prompt = `请告诉我从伦敦到约翰内斯堡的传输路由方案，要求速率500M。`

export const sqlQuery = `{"ANode": "伦敦", "ZNode": "约翰内斯堡", "rate": "500M"}`